Autodesk.Revit.DB.Structure.IStructuralConnectionsProviderProxy.GetConnectionTypeVisibility(Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData)
The method that will be called to check visibility settings for the given connection type.
Remarks:
The Connections Provider provides information about visibility settings for the given connection type.
data:
The Structural Connections Type Info data.
Returns:
Indicates whether the Structural Connections Provider is executed successfully.
Since:
2017